tutorials/multiphaseTransport/interTransportFoam/2DthroatMultiphaseTransport/0_org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            globalConcentrationMixed;
    }
    inlet
    {
	type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
	type            zeroGradient;
    }
    frontandback
    {
	type            empty;
    }
}

// ************************************************************************* //
